"Family '[Name]' cannot be upgraded and must be deleted. To fix the file in the older version of Revit, try loading newer versions of these families: [Names]."
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyCannotBeUpgraded { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyCannotBeUpgraded As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyCannotBeUpgraded {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace